app/controllers/events_controller.rb

	def create

		@event = Event.new(event_params.merge({:admin_id => current_user.id}))
		@event.status = 0
		if @event.save
---
INSERT INTO "events" ("address", "admin_id", "city", "created_at", "description", "event_time", "picture_content_type", "picture_file_name", "picture_file_size", "picture_updated_at", "state", "status", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)